{
    "Get information about the problem, its actors and the terminology.":"Obtén información acerca del problema, sus actores y la terminología.",
    "Explore the knowledge center of Alimentalos": "Explora el centro de conocimiento de Alimentalos",
    "About": "Acerca de",
    "Project documentation": "Documentación del proyecto",
    "Actors and resources": "Actores y recursos",
    "Problem and solution": "Problemática y solución",
    "Terms": "Términos",
    "Developer handbook": "Guía del desarrollador",
    "Introduction": "Introducción",
    "Get started": "Comenzar",
    "Project": "Proyecto",
    "Name": "Nombre",
    "Confirm Password": "Confirmar contraseña",
    "Creates a new account in our community.": "Crea una cuenta en nuestra comunidad.",
    "Login": "Iniciar sesión",
    "Register": "Registrarse",
    "Conventions": "Convenciones",
    "Every day humans abandon or lose pets in the corners of the earth. Many people are worried daily about the care of these animals. We create a space to make visible these animals in a state of abandonment and allow their insertion in the community.": "Cada día humanos abandonan o pierden mascotas en los rincones de la tierra. Muchas personas se preocupan a diario del cuidado de esos animales. Nosotros creamos un espacio para visibilizar a estos en estado de abandono y permitir su re-integración a la comunidad.",
    "Alimentalos is a open source project created to bring care and love to abandoned pets.": "Alimentalos es un proyecto de código abierto creado para brindar cuidado y amor a los animales abandonados.",
    "You and others can be part of the change of consciousness. Find the grain of divinity in the gaze of its creation. The resources required are only food and time. Today there are specialized groups which are organized to provide care for these creatures. Participate and join a group, meet people and discover people with your same interests.": "Tu y otros pueden ser parte del cambio de consciencia. Encuentra el grano de divinidad en los ojos de su creación. Los recursos requeridos solo son comida y tiempo. Hoy día hay grupos especializados que proveen cuidado a estas criaturas. Participa, únete a un grupo y descubre a otras personas con tus mismos intereses.",
    "Documentation": "Documentación",
    "Resource": "Recurso",
    "Next page": "Siguiente página",
    "Animal cared by humans.": "Animal cuidado por humanos.",
    "A convention is a healthy agreement between two or more parties. For a common understanding. Our main convention is mutual respect and care of the environment.": "Una convencón es un acuerdo saludable entre dos o más partes. Para un común entendimiento. Nuestra principal convención es el respeto mutuo y cuidado del medio ambiente.",
    "This documentation is focus to provide notions to introduce a PHP code writer to the mission of add new features or maintaining existing code.": "Esta documentación tiene como foco proveer nociones de introducción a un escritor de código PHP en la misión de añadir nuevas características o mantener código existente.",
    "Our code aspires to the highest quality, not in terms of performance but readability, although it considers performance in all cases.": "Nuestro código aspira a la máxima calidad, no en término de rendimiento pero sí en legibilidad, de igual forma considera el rendimiento en todos los casos.",
    "If you felt identified by the description of PHP code writer then you have the ability to incorporate new lines of code into our humble book. To collaborate in the construction or improvement of the solution you do not need to have great knowledge in object-oriented programming or mathematics, in most cases the code is prepared in such a way that anyone can add their grain of sand knowing the rules of language of programming and proper English.": "Si te sentiste identificado con la descripción de escritor de código PHP entonces tu tienes la habilidad para incorporar nuevas líneas de código en nuestro humilde libro. Para colaborar en la consrucción o mejora de la solución no necesitas grandes conocimientos en programación orientada a objetos o matemáticas, en la mayoría de los casos el código está preparado de tal forma que cualquiera puede añadir un granito de arena sabiendo las reglas del lenguaje de programación con un Inglés apropiado.",
    "Physical space represented by a coordinate.": "Espacio físíco representado por una coordenada.",
    "Software are built automatically so that all code will be subject to scrutiny of the tests defined according to the version or distribution.": "Código debe ser compilado automáticamente por aquello todo código será sometido al escrutinio de las pruebas definidas acorde a la versión o distribución.",
    "Point composed polygon that frame a physical space.": "Polígono compuesto por puntos que marcan un espacio físico.",
    "Is everything that can be systematically registered, listed, edited or deleted.": "Es todo aquello que puede ser sistemáticamente registrado, listado, editado o eliminado.",
    "Human who has system access granted by credentials.": "Humanos que tienen acceso al sistema utilizando sus credenciales.",
    "The acceptance of any change will depend mainly on the arguments. Any new addition will require the specification of new tests. Any modification will depend on its compatibility and impact on the system.": "La aceptación de cualquier cambio dependerá principalmente de los argumentos. Toda nueva añadidura dependerá de su compatibilidad e impacto en el sistema.",
    "The issue is the best way to solve code regarding problems with the community. Repositories are available to resolve conflicts, propose ideas or require help.": "La incidencia es la mejor forma de solucionar problemas relacionados al código de la mano de la comunidad. Repositorios están disponibles para resolver conflictos, proponer ideas o solicitar ayuda.",
    "Group of humans who share resources.": "Grupo de humanos quienes comparten recursos.",
    "Reset password": "Recuperar contraseña",
    "This project is built with Laravel using the latest version of PHP.": "Este proyecto está construido con Laravel utilizando la última versión de PHP.",
    "Send Password Reset Link": "Enviar enlace de recuperación",
    "- PHP 7.4 and Composer 1.9.3.": "- PHP 7.4 y Composer 1.9.3.",
    "- MySQL 8.0 running with fresh database and authorized access.": "- MySQL 8.0 funcionando con credenciales de acceso y una base de datos.",
    "- Bash and git.": "- Bash y git.",
    "Disclaimer of code origins": "Aviso del orígen del código",
    "Our code is built with the highest standards we handle, however, we depend on third-party libraries in which we cannot guarantee the security or origin of the files. In spite of this, the repositories have the definition of each one of their dependencies with the digital signatures that correspond to the provider of the code.": "Nuestro código está construido con los más altos estandares que nosotros manejamos, como sea, dependemos de librerías de terceras partes por lo cual no podemos garantizar la seguridad del orígen de esos archivos. Para remediar esto, los repositorios cuentan con la definición de cada una de las dependencias con una firma digital que corresponda al proveedor de código.",
    "License": "Licencia",
    "About our license concept": "Sobre el concepto de licencia",
    "We believe that the code is free and therefore, you are free to copy, modify and use the code as you see fit. As long as you respect the licenses of the co-authors and make a mention of the authors.": "Creemos que el código es libre y por consiguiente, tu eres libre de copiar, modificar y usar nuestro código como te acomode. Siempre y cuando respete las licencias de los co-autores y presente una mención de los autores.",
    "We do not offer a license to distribute our software.": "Nosotros no ofrecemos una licencia para distribuir nuestro código.",
    "Our software is under development, most of its components have open source licenses either MIT or Apache.": "Nuestro código está en proceso de desarrollo y la mayoría de sus componentes tienen licencias abiertas de tipo Apache o MIT.",
    "This project aims to have an open collaboration with the community.": "Este proyecto apunta a tener una abierta colaboración con la comunidad.",
    "We are available to answer questions, repair errors and improve the existing code with new features.": "Estamos disponibles para responder consultas, reparar errores y mejorar el código existente con nuevas características.",
    "Find us in our repositories or send us an email to iantorres@outlook.com.": "Encuéntranos en nuestros repositorios o escríbenos un correo a iantorres@outlook.com.",
    "1. Clone using bash or github for windows.": "1. Clona el repositorio utilizando bash o github para windows.",
    "Our acceptance criteria are simple, complying with the existing tests is a very important factor.": "Nuestros criterios de aceptación son simples, cumpliendo con las pruebas automáticas es un factor bastante importante.",
    "As already mentioned, the argument used will be decisive when adding new features to the code.":  "Como mencionamos en el principio de la guía, el argumento usado es decisivo cuando se añade nuevas características al código.",
    "We also expect that the added code meets the language specifications and has a low level of cognitive complexity when it is read.": "Nosotros esperamos que el código añadido comparta las especificaciones del lenguaje y tenga un bajo nivel de complejidad cognitiva cuando sea leido",
    "2. Install the required dependencies with <code>composer install</code>.": "2. Instala las dependencias requeridos con <code>composer install</code>.",
    "3. Copy and configure the database environment variables from <code>.env.example</code> to <code>.env</code>.": "3. Copia y configura las variables de entorno del archivo <code>.env.example</code> a <code>.env</code>.",
    "4. Run local server by running <code>php artisan serve</code> or <code>vendor/bin/phpunit</code> to run the suit of tests.": "4. Corre el servidor local con <code>php artisan serve</code> o <code>vendor/bin/phpunit</code> para correr las pruebas.",
    "We consume public libraries to not reinvent the wheel, at *all*...": "Utilizamos librerías abiertas para no reinventar la rueda, del *todo*...",
    "- The api of reactions is mainly built using the cybercog/laravel-love package.": "- La api de reacciones está construida principalmente con el paquete cybercog/laravel-love.",
    "- The logic related to the insertion and search of geo-spatial data is implemented from the grimzy/laravel-mysql-spatial package.": "- La lógica relacionada a la inserción y búsqueda de datos geo-espaciales está implementado en base al paquete grimzy/laravel-mysql-spatial.",
    "- The barryvdh/laravel-cors package avoids a couple of headaches related to the handling of authorization http headers related to origins (I think).": "- El paquete barryvdh/laravel-cors nos evita un montón de dolores de cabeza relacionada a los encabezados de orígen (Yo creo).",
    "- The unique identifiers generation is based on the implementation of webpatser/laravel-uuid package.": "- Los identificadores únicos son generados en base a la implementación del paquete de webpatser/laravel-uuid.",
    "All other dependencies of project are described in composer.json and package.json file.": "Las otras dependencias del proyecto están descritas en los archivos composer.json y package.json.",
    "Thanks to those who contributed. :)": "Gracias a todos quienes aportaron. :)",
    "Complete the following form and receive a reset link.": "Completa el siguiente formulario y recibe un enlace de recuperación.",
    "Connect to our community using your credentials.": "Conectate a nuestra comunidad utilizando tus credenciales.",
    "E-Mail Address": "Correo electrónico",
    "Password": "Contraseña",
    "Remember Me": "Recuérdame",
    "Forgot Your Password?": "¿Olvidaste tu contraseña?",
    "Before page": "Página anterior",
    "Patterns": "Patrones",
    "Resume": "Resumen",
    "Specified": "Específicos",
    "PHP and framework": "PHP y el framework",
    "Requisites": "Requisitos",
    "Steps": "Pasos",
    "Models": "Modelos",
    "Location": "Ubicación",
    "Pet": "Mascota",
    "Photo": "Foto",
    "Verify your account": "Verifica tu cuenta",
    "Please, check in your inbox our email confirmation.": "Revisa tu casilla de correo electrónico",
    "Bring care and love to *abandoned pets*.": "Brindando cuidado y amor a las *mascotas abandonadas*.",
    "If you did not receive the email": "Si no has recibido este correo",
    "click here to request another": "presiona aquí para pedir otro",
    "Before proceeding, please check your email for a verification link.": "Antes de continuar, por favor revisa nuestra confirmación de correo electrónico con el enlace de activación.",
    "Group": "Grupo",
    "Comment": "Comentario",
    "Dashboard": "Escritorio",
    "Access": "Acceso",
    "Logout": "Cerrar sesión",
    "You are logged in!": "Has iniciado sesión correctamente.",
    "Alert": "Alerta",
    "Device": "Dispositivo",
    "Nothing": "Ninguna",
    "Recommended": "Recomendado",
    "Action": "Acción",
    "Directories": "Directorios",
    "User": "Usuario",
    "Geofence": "Geocerca",
    "Events": "Eventos",
    "Relationships": "Relaciones",
    "Commons": "Frecuentes",
    "Repositories": "Repositorios",
    "Lists": "Listas",
    "Read more": "Leer más",
    "Authentication": "Autenticación",
    "Contracts": "Contratos",
    "Learn about software license and code usage disclaimer": "Aprende sobre nuestras licencias y advertencias de uso de código.",
    "Attributes": "Atributos",
    "Procedures": "Procedimientos",
    "Policies": "Políticas",
    "Observers": "Observadores",
    "Asserts": "Aseveraciones",
    "Queries": "Consultas",
    "Creations": "Creaciones",
    "Reports": "Reportes",
    "Annotations": "Anotaciones",
    "Helpers": "Utilitarios",
    "Table of contents": "Tabla de contenidos",
    "Tools": "Herramientas",
    "Rules": "Reglas",
    "Language and tools": "Lenguaje y herramientas",
    "Installation": "Instalación",
    "Project structure": "Estructura del proyecto",
    "Collaboration": "Colaboración",
    "Criteria of acceptance": "Criterios de aceptación",
    "Nueva linea incluida": "ABC",
    "Obtain information related to the design of the solution, its components and patterns. If you are a developer this section can be quite useful.": "Obtén información relacionada al diseño de la solución, sus componentes y patrones. Sí eres un desarrollador, esta sección puede ser bastante útil."
}
